       FD ENT-ALUMNOS.
       01 WS-ENT-ALUMNOS.
          05 WS-ENT-ALUMNOS-FECHA-EXAMEN      PIC X(10).
          05 WS-ENT-ALUMNOS-NOMBRE            PIC X(40).
          05 WS-ENT-ALUMNOS-MATERIA           PIC X(30).
          05 WS-ENT-ALUMNOS-NOTA              PIC 9(5)V9(3).
          