       FD SALIDA-DESCARTADOS.
       01 WS-SAL-DESC-DETALLE.
          05 WS-SAL-DESC-NOMBRE      PIC X(40).
          05 FILLER                      PIC X(06) VALUE '    | '.
          05 WS-SAL-DESC-MATERIA         PIC X(30).
          05 FILLER                      PIC X(03) VALUE ' | '.
          05 WS-SAL-DESC-CANTIDAD        PIC X(10).
          05 FILLER                      PIC X(03) VALUE ' | '.
             
             