       FD SALIDA-ERROR.
       01 WS-SAL-ERROR-DETALLE.
          05 WS-SAL-ER-ALUMNOS-FECHA-EXAMEN      PIC X(10).
          05 WS-SAL-ER-ALUMNOS-NOMBRE            PIC X(40).
          05 WS-SAL-ER-ALUMNOS-MATERIA           PIC X(30).
          05 WS-SAL-ER-ALUMNOS-NOTA              PIC 9(5)V9(3).